function [ VCm ] = VC_MIX( molefrac)
%计算整体性质，计算出临界体积单位为cm3/g
%   VC为临界体积（一维）；molefrac为摩尔分数矩阵（一维）
VC2=[3.20369267 1 1.1 0.7 0.8;
4.08470816	4.148782014	3.860449673	0.9	0.5;
5.013779036	4.901649792	4.699817154	4.164800477	0.12;
5.942849912	5.894794522	5.574425255	4.933686719	4.100726624;
6.855902324	6.471459203	6.439422276	5.926831448	5.061834426;
7.7849732	7.624788566	7.432567006	6.727754617	6.006923765;
8.826173319	8.665988685	8.393674808	7.432567006	6.935994641;
9.883391902	9.338764147	9.35478261	8.457748661	7.720899346;
10.97264741	10.33991811	10.52413044	8.5	8.649970222;
12.09393985	11.72551519 0.4 0.3 0.2];%单位为cuft/lbmol
VC=conv_mat2_to_mat1( VC2 );
molefrac2=conv_mat2_to_mat1( molefrac );
m=size(VC,2);
for i=1:m
    for j=1:m
n(i,j)=abs((VC(i)-VC(j))/(VC(i)+VC(j)));
    end
end
V=n.*(-1.4684);
for i=1:m
    for j=1:m
        v(i,j)=V(i,j)*(VC(i)+VC(j))/2;
    end
end
sum0=0;
for i=1:m
 sum0=sum0+(VC(i))^(2/3)*molefrac2(i);
end
for i=1:m
    fai(i)=(VC(i))^(2/3)*molefrac2(i)/sum0;
end

sum1=0;
 for i=1:m
     for j=1:m
         sum1=sum1+fai(i)*fai(j)*v(i,j);
     end
 end
  VCa=sum(fai.*VC)+sum1;
 MW=MW_MIX( molefrac );
  VCm=VCa*28316.8/0.453592/MW/1000;%单位为cm3/g
end

